Rhino.Inside.Revit API
GeometryEncoder.ToCurve Method (LineCurve)
 Converts the specified Rhino.Geometry.LineCurve to an equivalent of Autodesk.Revit.DB.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Autodesk.Revit.DB.Curve ToCurve(
	this Rhino.Geometry.LineCurve lineCurve
)
@staticmethod
def ToCurve(
	lineCurve: Rhino.Geometry.LineCurve
) -> Autodesk.Revit.DB.Curve
Parameters
lineCurve
Type: Rhino.Geometry.LineCurve
Rhino lineCurve to convert.
Return Value
Type: Autodesk.Revit.DB.Curve
Revit curve that is equivalent to the provided Rhino lineCurve.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.LineCurve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurve(LineCurve) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Curve revitCurve = rhinoLineCurve.ToCurve();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_curve = rhino_linecurve.ToCurve()    # type: DB.Curve
 Using ToCurve(LineCurve) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Curve revitCurve = GeometryEncoder.ToCurve(rhinoLineCurve);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_curve = GE.ToCurve(rhino_linecurve)    # type: DB.Curve
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace